app/Controllers/AdminController.php

SELECT *
FROM `tbl_event`
WHERE `status` = '1'
---
    public function viewEvents()
    {
        $status = $this->request->getGet('status');
        $eventModel = new EventModel();
        $events = $eventModel->where('status', $status)->findAll();

SELECT *
FROM `tbl_residents`
WHERE `status` = '1'
---
    public function getArchivedResidents() {
        $residentModel = new ResidentModel();
        $residents = $residentModel->where('status', '0')->findAll();

SELECT *
FROM `tbl_inventory`
WHERE `status` = 1
---
    public function getInventoryData()
    {
        $inventoryModel = new InventoryModel();

        $items = $inventoryModel->where('status', 1)->findAll();