app/Controllers/AdminController.php

    public function loadInventoryHistory()
    {
        $model = new InventoryHistoryModel();

        $inventoryHistory = $model->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `tbl_inventory_history`
ORDER BY `created_at` DESC

public function countHouseWithStatus()
{
    $houseModel = new HouseModel();

    $count = $houseModel->where('status', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_house`
WHERE `status` = 1