app/Controllers/AdminController.php

    public function viewEvents()
    {
        $status = $this->request->getGet('status');
        $eventModel = new EventModel();
        $events = $eventModel->where('status', $status)->findAll();
---
SELECT *
FROM `tbl_event`
WHERE `status` = '1'

    public function loadResidents()
    {
        $residentModel = new ResidentModel();

        $residents = $residentModel->where('status', '1')->findAll();
---
SELECT *
FROM `tbl_residents`
WHERE `status` = '1'