app/Controllers/AuthController.php

INSERT INTO `tbl_audit` (`action`, `user`, `date`, `created_at`, `updated_at`) VALUES ('Logged in', 'Tovvy Dumaplin', '2025-05-01 02:32:37', '2025-05-01 02:32:37', '2025-05-01 02:32:37')
---
    public function processLogin()
    {
        $session = session();
        $model = new UserModel();
        $auditModel = new \App\Models\AuditModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();

        if ($user) {
            if (password_verify($password, $user['password'])) {
                $sessionData = [
                    'account_id'    => $user['account_id'],
                    'username'      => $user['username'],
                    'role'          => $user['role'],
                    'token'         => $user['token'],
                    'image'         => $user['image'],
                    'firstname'     => $user['firstname'],
                    'lastname'      => $user['lastname'],
                    'middlename'    => $user['middlename'],
                    'suffix'        => $user['suffix'],
                    'logged_in'     => true
                ];
                $session->set($sessionData);

                // ✅ Save to audit trail
                $fullname = $user['firstname'] . ' ' . $user['lastname'];
                $auditModel->insert([
                    'action' => 'Logged in',
                    'user'   => $fullname,
                    'date'   => date('Y-m-d H:i:s')
                ]);

INSERT INTO `tbl_audit` (`action`, `user`, `date`, `created_at`, `updated_at`) VALUES ('Logged out', 'Kai Dalton', '2025-05-06 10:54:08', '2025-05-06 10:54:08', '2025-05-06 10:54:08')
---
    public function logout()
    {
        $session = session();
        $fullname = $session->get('firstname') . ' ' . $session->get('lastname');

        $auditModel = new \App\Models\AuditModel();
        $auditModel->insert([
            'action' => 'Logged out',
            'user'   => $fullname,
            'date'   => date('Y-m-d H:i:s')
        ]);